In [1]:
import numpy as np
import pandas as pd

---
# Class_A and Class_B

In [2]:
class_a = pd.DataFrame({
    'id':[1,2,3],
    'name':['tanaka', 'suzuki', 'ijuin'],
})
class_a

   id    name
0   1  tanaka
1   2  suzuki
2   3   ijuin

In [3]:
class_b = pd.DataFrame({
    'id':[1,2,4],
    'name':['tanaka', 'suzuki', 'saionji']
})
class_b

   id     name
0   1   tanaka
1   2   suzuki
2   4  saionji

In [4]:
class_a.to_csv('../../dataset/performance/class_a.csv', index = False)
class_b.to_csv('../../dataset/performance/class_b.csv', index = False)

---
# Items and SalesHistory

In [5]:
items = pd.DataFrame({
    'item_no':[10, 20, 30, 40],
    'item':['sd-card', 'cd-r', 'usb-memory', 'dvd'],
})
items

   item_no        item
0       10     sd-card
1       20        cd-r
2       30  usb-memory
3       40         dvd

In [6]:
saleshistory = pd.DataFrame({
    'sale_date':['-'.join(v) for v in zip(['2018']*7, ['10']*7, [str(e).zfill(2) for e in [1,1,1,3,3,4,4]])],
    'item_no':[10, 20, 30, 10, 30, 20, 30],
    'quantity':[4, 10, 3, 32, 12 , 22, 7]
})

In [7]:
saleshistory

    sale_date  item_no  quantity
0  2018-10-01       10         4
1  2018-10-01       20        10
2  2018-10-01       30         3
3  2018-10-03       10        32
4  2018-10-03       30        12
5  2018-10-04       20        22
6  2018-10-04       30         7

In [8]:
items.to_csv('../../dataset/performance/items.csv', index = False)
saleshistory.to_csv('../../dataset/performance/saleshistory.csv', index = False)